
&НаКлиенте
Процедура СоздатьПользователя(Команда)
	СоздатьПользователяНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователяНаСервере()
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = Объект.Наименование;
	Пользователь.Пароль = Объект.Пароль;
	
	Мета = Метаданные.Роли;
	Для каждого Строка  Из Объект.Роли  Цикл
	    Стр = Строка.Роль;
		Пользователь.Роли.Добавить(Мета.Найти(Стр.Наименование));
	
	КонецЦикла;
	
	Пользователь.Записать();
КонецПроцедуры
